tbobd/certification3/test4/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:AgencyReferenceNumber>BUGSOFT1</hot:AgencyReferenceNumber>
        <hot:ClientReferenceNumber>210314135855789#aabl</hot:ClientReferenceNumber>
        <hot:GuestNationality>ES</hot:GuestNationality>
        <hot:Guests>
            <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajayge</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>28</hot:Age>
            </hot:Guest>
            <hot:Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Mayax</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>22</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="false" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>e5fa33c1-147a-49be-a03a-c56db1235e7a</hot:SessionId>
        <hot:NoOfRooms>2</hot:NoOfRooms>
        <hot:ResultIndex>3</hot:ResultIndex>
        <hot:HotelCode>1258556</hot:HotelCode>
        <hot:HotelName>Rose Garden Hotel Apartments Barsha</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomTypeName>Studio,2 Twin Beds</hot:RoomTypeName>
                <hot:RoomTypeCode>280257|200058859$37341^^1^^280257|200058859|37341</hot:RoomTypeCode>
                <hot:RatePlanCode>280257|200058859|37341</hot:RatePlanCode>
                <hot:RoomRate RoomFare="370.41" Currency="USD" AgentMarkUp="0.00" RoomTax="83.17" TotalFare="453.58"/>
                <hot:Supplements>
                    <hot:SuppInfo Type="PerStaySupplement" SuppID="1" SuppName="mandatory_tax" SuppIsMandatory="true" SuppChargeType="AtProperty" Price="40.00" CurrencyCode="AED" />
                </hot:Supplements>
            </hot:HotelRoom>
            <hot:HotelRoom>
                <hot:RoomIndex>2</hot:RoomIndex>
                <hot:RoomTypeName>Studio,2 Twin Beds</hot:RoomTypeName>
                <hot:RoomTypeCode>280257|200058859$37341^^2^^280257|200058859|37341</hot:RoomTypeCode>
                <hot:RatePlanCode>280257|200058859|37341</hot:RatePlanCode>
                <hot:RoomRate RoomFare="370.41" Currency="USD" AgentMarkUp="0.00" RoomTax="83.17" TotalFare="453.58"/>
                <hot:Supplements>
                    <hot:SuppInfo Type="PerStaySupplement" SuppID="1" SuppName="mandatory_tax" SuppIsMandatory="true" SuppChargeType="AtProperty" Price="40.00" CurrencyCode="AED" />
                </hot:Supplements>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>